{
	"name": "General Info",
	"icon": "nuclearcraft:fission_casing",
	"category": "nuclearcraft:fission",
	"sortnum": 0,
	"pages": [
		{
			"anchor": "intro",
			"type": "text",
			"text": "Fission reactors generate heat from the self-sustained nuclear reaction of fission fuel. This heat is ultimately transformed into useful energy, and the way this is achieved depends on the type of reactor being built."
		},
		{
			"anchor": "casing",
			"type": "blocks/2",
			"header": "Reactor Casing",
			"block1": "nuclearcraft:fission_casing",
			"block2": "nuclearcraft:fission_glass",
			"text": "The reactor's interior components are contained within a cuboidal structure. The edges must consist of reactor casing, while reactor glass can be used instead of casing for the walls. When the multiblock forms, the casing blocks on the edges will be given a new frame texture."
		},
		{
			"anchor": "controller",
			"type": "blocks/3",
			"header": "Reactor Controllers",
			"block1": "nuclearcraft:pebble_fission_controller",
			"block2": "nuclearcraft:solid_fission_controller",
			"block3": "nuclearcraft:salt_fission_controller",
			"text": "The type of reactor is determined by the controller, installed in one of the reactor walls. Without a controller, the multiblock will not form. Its GUI will show information about the reactor as a whole, such as the averages of relevant components' stats."
		},
		{
			"anchor": "conductor",
			"type": "blocks/1",
			"header": "Conductor Blocks",
			"block": "nuclearcraft:fission_conductor",
			"text": "If the structure contains groups of components disconnected from the casing, the multiblock can not form. Conductor blocks can be used to join these blocks to the reactor's walls. $(l)Clusters$() can also be connected together with the use of these blocks."
		},
		{
			"anchor": "clusters",
			"type": "text",
			"title": "Reactor Clusters",
			"text": "Clusters are simply connected groups of heat-conducting components. Components which can be in an active or idle state only conduct heat when functional, while passive blocks such as conductor blocks always do. Moderator and reflector blocks do $(l)not$() make up clusters. The components share a combined heat level, so will collectively overheat if they get too hot."
		},
		{
			"anchor": "monitor",
			"type": "blocks/1",
			"header": "Reactor Monitors",
			"block": "nuclearcraft:fission_monitor",
			"text": "Monitors are used to get more localised information about the reactor, particularly the stats of individual clusters."
		},
		{
			"anchor": "fuel_component",
			"type": "blocks/3",
			"header": "Fuel Components",
			"block1": "nuclearcraft:pebble_fission_chamber",
			"block2": "nuclearcraft:solid_fission_cell",
			"block3": "nuclearcraft:salt_fission_vessel",
			"text": "Each type of reactor has an associated fuel component which houses the fission fuel. When the fuel is undergoing fission, it produces a certain amount of heat. Fuel components can also be filtered by right-clicking the component with a fuel to allow for multi-fuel reactors."
		},
		{
			"anchor": "criticality",
			"type": "text",
			"title": "Criticality Factor",
			"text": "For fuels to be able to undergo fission, they need to recieve a certain $(l)neutron flux$(), which is measured in N/t. When the neutron flux going into a $(l:fission/general#fuel_component)fuel component$() is above the fuel's criticality factor, the fuel will start undergoing fission. This will not only produce heat, but also more neutrons. $(l:fission/general#moderator)Moderators$() can slow down these high energy neutrons into ones that will cause more fission in other fuel components."
		},
		{
			"anchor": "moderator",
			"type": "blocks/3",
			"header": "Moderators",
			"block1": "nuclearcraft:ingot_block:8",
			"block2": "nuclearcraft:ingot_block:9",
			"block3": "nuclearcraft:heavy_water_moderator",
			"text": "Moderators are placed in a straight line, no more than 4 blocks long. At one end of the moderator line there must be an $(l)active$() fuel component. The neutron flux 'generated' at the other end will be equal to the sum of the flux factors of each of the moderators in that line."
		},
		{
			"type": "text",
			// "title": "Moderators Continued",
			"text": "This works in both ways: if there are active fuel cells on both ends of the moderator line, then both cells will recieve neutron flux equal to the sum of the flux factors of each moderator in the line."
		},
		{
			"anchor": "reflector",
			"type": "blocks/2",
			"header": "Reflectors",
			"block1": "nuclearcraft:fission_reflector:0",
			"block2": "nuclearcraft:fission_reflector:1",
			"text": "Reflectors can reflect the neutrons back at the source with various efficiencies. Reflectors have to be within "
		},
		{
			"anchor": "irradiator",
			"type": "blocks/1",
			"header": "Irradiators",
			"block": "nuclearcraft:fission_irradiator",
			"text": "(irradiator)"
		},
		{
			"anchor": "shield",
			"type": "blocks/1",
			"header": "Shields",
			"block": "nuclearcraft:fission_shield:0",
			"text": "(shield)"
		}
	]
}