{
    "name": "Turbine Blocks",
    "icon": "nuclearcraft:turbine_controller",
    "category": "nuclearcraft:multiblocks",
    "pages": [
        {
            "anchor": "intro",
            "type": "text",
            "text": "Turbines convert the thermal energy from steam into (rf/fe/electricity?)."
        },
        {
            "anchor": "casing",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_casing",
            "text": "Forms the frame of the reactor. Casings are required along all the edges and corners of a turbine. They can also be used to fill in the faces of the turbine."
        },
        {
            "anchor": "glass",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_glass",
            "text": "Can be used instead of casing to fill in the faces of the turbine. If glass is used, the inside of the turbine will be rendered, which can cause extra lag."
        },
        {
            "anchor": "controller",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_controller",
            "text": "The brains of the turbine. One and only one is required in one of the turbine's faces for the multiblock to form. The turbine will only work if the controller is supplied with a redstone signal."
        },
        {
            "anchor": "rotor_bearing",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_rotor_bearing",
            "text": "Connects the turbine rotor shaft to the casing. Bearings must cover the entire end of the rotor shaft on both sides. Bearings are placed on opposite faces of the turbine."
        },
        {
            "anchor": "rotor_shaft",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_rotor_shaft",
            "text": "The core of the turbine. Must be a cuboid shape, in the center of the turbine, and connected to bearings on both ends."
        },
        {
            "anchor": "rotor_blades",
            "type": "machines/3_tier_machine",
            "header": "Turbine Rotor Blades",
            "tier1": "nuclearcraft:turbine_rotor_blade_steel",
            "tier2": "nuclearcraft:turbine_rotor_blade_extreme",
            "tier3": "nuclearcraft:turbine_rotor_blade_sic_sic_cmc",
            "text": "These use the energy of the steam to turn the rotor shaft. Blades must be placed in sets, so that there is only one type of blade per 'shaft layer'. Each side of the turbine shaft needs to be covered by blades, and they need to extend to the wall of the turbine."
        },
        {
            "type": "text",
            "text": "Each blade processes a certain amount of steam, and if more steam is input than the blades can process, the turbine can break. When steam flows through each set of blades, it expands by a certain amount. The closer this expansion rate is to the ideal expansion rate for the input steam, the more efficient the turbine will be. (link to turbine math:blades)"
        },
        {
            "anchor": "stator",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_rotor_stator",
            "text": "Similar to blades, except when steam passes through it, it contracts instead of expanding. Stators do not process steam like blades do; they do not add to the turbine's maximum steam. Placement rules are the same as rotor blades."
        },
        {
            "anchor": "dynamo_coil",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_dynamo_coil",
            "text": "Dynamo coils turn the rotational energy of the shaft into (rf/fe/electricity?). They are placed on the same faces as the rotor bearings. Each type of dynamo coil has an efficiency multiplier, and placement rules. (link to turbine math:dynamo coil efficiencies). component processor to dynamically display list of items"
        },
        {
            "anchor": "inlet",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_inlet",
            "text": "Allows steam to enter the turbine. Must be placed on one of the faces of the turbine that has a rotor bearing. Must be on the opposite face of the turbine outlet"
        },
        {
            "anchor": "outlet",
            "type": "machines/single_machine",
            "block": "nuclearcraft:turbine_outlet",
            "text": "Allows exhaust steam to exit the turbine. Must be placed on one of the faces of the turbine that has a rotor bearing. Must be on the opposite face of the turbine inlet."
        }
    ]
}